data/communication.dot
digraph GrillBotInfrastructure {
    rankdir=LR
    
    subgraph cluster_0 {
        color=Darkgreen
        
        Bot
        Graphics
        Docs
        RubbergodService
        FileService
        PointsService
        
        label = "Internal GrillBot infrastructure";
    }

    subgraph cluster_1 {
        color=blue
        
        KachnaOnline
        MathJs[label="Math.JS"]
        Rubbergod
        AzureStorageAccount[label="Azure Storage Account"]
        
        label = "Third party services";
    }
  
    Docs -> Bot [label="GET /health"]
    Bot -> MathJs [label="POST /"]
    Bot -> KachnaOnline [label="GET /api/states/current"]
    Bot -> Graphics
    Bot -> RubbergodService
    Bot -> PointsService
    Rubbergod -> Bot [label="GET /api/user/birthday/today\nPOST /api/user/karma/store"]
    Bot -> FileService
    FileService -> AzureStorageAccount
}
